Pinkcliff/stm32/three_leds.c
/*
 * STM32 三LED点灯程序
 * 假设使用的是STM32F103系列
 * LED1连接到PC13，LED2连接到PC14，LED3连接到PC15
 */

#include "stm32f10x.h"

void LEDs_Init(void);
void Delay(uint32_t count);
void LED_Show_Pattern(uint8_t pattern);

// LED引脚定义
#define LED1_PIN    GPIO_Pin_13
#define LED2_PIN    GPIO_Pin_14
#define LED3_PIN    GPIO_Pin_15
#define LED_PORT    GPIOC

// 模式定义
#define LED_ALL_OFF     0x00
#define LED1_ON         0x01
#define LED2_ON         0x02
#define LED3_ON         0x04
#define LED1_2_ON       0x03
#define LED1_3_ON       0x05
#define LED2_3_ON       0x06
#define LED_ALL_ON      0x07

int main(void)
{
    uint16_t delay_count = 300000;

    // 初始化LED引脚
    LEDs_Init();

    while(1)
    {
        // 模式1：依次点亮LED1、LED2、LED3
        LED_Show_Pattern(LED1_ON);
        Delay(delay_count);

        LED_Show_Pattern(LED2_ON);
        Delay(delay_count);

        LED_Show_Pattern(LED3_ON);
        Delay(delay_count);

        // 模式2：LED1和LED3同时点亮
        LED_Show_Pattern(LED1_3_ON);
        Delay(delay_count);

        // 模式3：所有LED依次点亮然后熄灭
        LED_Show_Pattern(LED_ALL_ON);
        Delay(delay_count);

        LED_Show_Pattern(LED_ALL_OFF);
        Delay(delay_count);

        // 模式4：交替闪烁
        LED_Show_Pattern(LED1_2_ON);
        Delay(delay_count/2);

        LED_Show_Pattern(LED2_3_ON);
        Delay(delay_count/2);

        LED_Show_Pattern(LED_ALL_OFF);
        Delay(delay_count);

        // 逐个点亮形成流水灯效果
        for(int i = 0; i < 3; i++) {
            LED_Show_Pattern(1 << i);
            Delay(delay_count/2);
        }

        // 反向流水灯
        for(int i = 2; i >= 0; i--) {
            LED_Show_Pattern(1 << i);
            Delay(delay_count/2);
        }

        LED_Show_Pattern(LED_ALL_OFF);
        Delay(delay_count);
    }
}

/**
 * @brief  三个LED初始化函数
 * @param  无
 * @retval 无
 */
void LEDs_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStructure;

    // 使能GPIOC时钟
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);

    // 配置PC13、PC14、PC15为推挽输出
    GPIO_InitStructure.GPIO_Pin = LED1_PIN | LED2_PIN | LED3_PIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(LED_PORT, &GPIO_InitStructure);

    // 初始状态下熄灭所有LED
    GPIO_SetBits(LED_PORT, LED1_PIN | LED2_PIN | LED3_PIN);
}

/**
 * @brief  LED模式显示函数
 * @param  pattern: LED显示模式 (使用位掩码)
 * @retval 无
 */
void LED_Show_Pattern(uint8_t pattern)
{
    if(pattern & LED1_ON) {
        GPIO_ResetBits(LED_PORT, LED1_PIN);  // LED1点亮 (低电平)
    } else {
        GPIO_SetBits(LED_PORT, LED1_PIN);    // LED1熄灭
    }

    if(pattern & LED2_ON) {
        GPIO_ResetBits(LED_PORT, LED2_PIN);  // LED2点亮
    } else {
        GPIO_SetBits(LED_PORT, LED2_PIN);    // LED2熄灭
    }

    if(pattern & LED3_ON) {
        GPIO_ResetBits(LED_PORT, LED3_PIN);  // LED3点亮
    } else {
        GPIO_SetBits(LED_PORT, LED3_PIN);    // LED3熄灭
    }
}

/**
 * @brief  简单延时函数
 * @param  count: 延时计数值
 * @retval 无
 */
void Delay(uint32_t count)
{
    uint32_t i;
    for(i = 0; i < count; i++);
}